In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv(r'C:\Users\User\My ML Models\Decision Tree\titanic.csv')
df.head()

   survived  pclass     sex   age     fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [3]:
new_df = df.drop(['sex'], axis=1)
new_df.head()

   survived  pclass   age     fare
0         0       3  22.0   7.2500
1         1       1  38.0  71.2833
2         1       3  26.0   7.9250
3         1       1  35.0  53.1000
4         0       3  35.0   8.0500

In [4]:
#checking Nan value
new_df.isnull().sum()

survived      0
pclass        0
age         177
fare          0
dtype: int64

In [5]:
#177 missing value so we go with median
new_df['age'].median()

28.0

In [6]:
final_df = new_df.fillna(value=28,axis=1 )
final_df

     survived  pclass   age     fare
0           0       3  22.0   7.2500
1           1       1  38.0  71.2833
2           1       3  26.0   7.9250
3           1       1  35.0  53.1000
4           0       3  35.0   8.0500
..        ...     ...   ...      ...
886         0       2  27.0  13.0000
887         1       1  19.0  30.0000
888         0       3  28.0  23.4500
889         1       1  26.0  30.0000
890         0       3  32.0   7.7500

[891 rows x 4 columns]

In [7]:
#now there is no NaN value
final_df.isnull().sum()

survived    0
pclass      0
age         0
fare        0
dtype: int64

In [8]:
#independence and dependence feature
X = final_df.iloc[:,1:]
y = final_df.iloc[:,:1]

In [9]:
#Training our mode
from sklearn.tree import DecisionTreeClassifier
decision_tree = DecisionTreeClassifier()
decision_tree.fit(X,y)

DecisionTreeClassifier()

In [11]:
#prediction 1
decision_tree.predict([[3,32.0,7.7500]])

array([0], dtype=int64)

In [12]:
#prediction 2
decision_tree.predict([[1,26.0,30.0000]])

array([1], dtype=int64)

In [13]:
#scoring
decision_tree.score(X,y)

0.9461279461279462